#10 minutes sur Pandas
Ceci est un court introduction a Pandas, généré principalement par les nouveaux utilisateurs. Vous pouvez voir de meilleures recettes dans le Cookbook.
On importe la bibliothèque ainsi :

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#Création d'objet
Regardez la section sur l'introduction sur les structures de données.
Créons une Series en passant une liste de valeur, pandas crée par défaut un index d'entier :

In [3]:
s = pd.Series([1,3,5,np.nan,6,8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

Creer un DataFrame en passant une liste nump, avec un index datetime et les colonnes appelées :

In [5]:
dates = pd.date_range('20130101', periods=6)

In [6]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))

In [8]:
df

                   A         B         C         D
2013-01-01 -0.506639 -0.261817  0.195977 -1.463272
2013-01-02  1.027316 -0.172998 -0.361223 -1.155115
2013-01-03 -1.030873 -0.538397 -1.402254  1.150479
2013-01-04 -0.578162  1.133134 -0.567537  0.711612
2013-01-05 -1.186215  1.311326 -1.522868  0.565255
2013-01-06 -1.548989 -1.048483 -0.048604  1.387529

Creer un DataFrame en passant un dictionnaire d'objet qui peuvent être converti comme des séries.

In [9]:
 df2 = pd.DataFrame({ 'A' : 1.,
   ....:                      'B' : pd.Timestamp('20130102'),
   ....:                      'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
   ....:                      'D' : np.array([3] * 4,dtype='int32'),
   ....:                      'E' : pd.Categorical(["test","train","test","train"]),
   ....:                      'F' : 'foo' })
   ....:

In [10]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Le tableau a des dtypes

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

Si vous utilisez IPython, le remplissage de tableau (comme les attributs public) est automatiquement activé. Voici un subset d'attributs qui sera complété.

In [12]:
df2.<TAB>
df2.A                  df2.bool
df2.abs                df2.boxplot
df2.add                df2.C
df2.add_prefix         df2.clip
df2.add_suffix         df2.clip_lower
df2.align              df2.clip_upper
df2.all                df2.columns
df2.any                df2.combine
df2.append             df2.combine_first
df2.apply              df2.compound
df2.applymap           df2.consolidate
df2.D

SyntaxError: invalid syntax (<ipython-input-12-61c30bd4fde6>, line 1)

Comme vous pouvez le voir, la colonne A,B,C et D sont automatiquement complétées. E est aussi là; le reste des attributs sont tronqués pour la concision.

Visualiser la donnée

Voyez la section des bases.
Regardez le haut & le bas des lignes de la frame.

In [13]:
df.head()

                   A         B         C         D
2013-01-01 -0.506639 -0.261817  0.195977 -1.463272
2013-01-02  1.027316 -0.172998 -0.361223 -1.155115
2013-01-03 -1.030873 -0.538397 -1.402254  1.150479
2013-01-04 -0.578162  1.133134 -0.567537  0.711612
2013-01-05 -1.186215  1.311326 -1.522868  0.565255

In [14]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.578162  1.133134 -0.567537  0.711612
2013-01-05 -1.186215  1.311326 -1.522868  0.565255
2013-01-06 -1.548989 -1.048483 -0.048604  1.387529

Afficher l'index, les colonnes et les données numpy.

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.values

array([[-0.50663935, -0.26181747,  0.19597669, -1.46327209],
       [ 1.0273162 , -0.17299824, -0.36122344, -1.15511524],
       [-1.03087273, -0.53839723, -1.40225416,  1.15047908],
       [-0.57816166,  1.13313357, -0.56753701,  0.71161199],
       [-1.18621478,  1.31132598, -1.52286831,  0.56525495],
       [-1.54898938, -1.04848328, -0.04860386,  1.38752915]])

La fonction Describe montre un rapide résumé de vos données

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.637260  0.070461 -0.617752  0.199415
std    0.903206  0.944610  0.705562  1.209265
min   -1.548989 -1.048483 -1.522868 -1.463272
25%   -1.147379 -0.469252 -1.193575 -0.725023
50%   -0.804517 -0.217408 -0.464380  0.638433
75%   -0.524520  0.806601 -0.126759  1.040762
max    1.027316  1.311326  0.195977  1.387529

Transposer vos données

In [19]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.506639    1.027316   -1.030873   -0.578162   -1.186215   -1.548989
B   -0.261817   -0.172998   -0.538397    1.133134    1.311326   -1.048483
C    0.195977   -0.361223   -1.402254   -0.567537   -1.522868   -0.048604
D   -1.463272   -1.155115    1.150479    0.711612    0.565255    1.387529

Ordonner par un axe

In [20]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -1.463272  0.195977 -0.261817 -0.506639
2013-01-02 -1.155115 -0.361223 -0.172998  1.027316
2013-01-03  1.150479 -1.402254 -0.538397 -1.030873
2013-01-04  0.711612 -0.567537  1.133134 -0.578162
2013-01-05  0.565255 -1.522868  1.311326 -1.186215
2013-01-06  1.387529 -0.048604 -1.048483 -1.548989

In [21]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06 -1.548989 -1.048483 -0.048604  1.387529
2013-01-03 -1.030873 -0.538397 -1.402254  1.150479
2013-01-01 -0.506639 -0.261817  0.195977 -1.463272
2013-01-02  1.027316 -0.172998 -0.361223 -1.155115
2013-01-04 -0.578162  1.133134 -0.567537  0.711612
2013-01-05 -1.186215  1.311326 -1.522868  0.565255

#Selection

Note : Tandis que les expressions de sellections et de configuration de Python / Numpy sont intuitifs et sont pratiques dans un travail interactif. Pour du code de production, nous recommandons les méthodes d'accès données de pandas, .at,.iat,.loc et .ix.
Voyez la documentation sur l'indexation et la selection de données et le multiindexage / Indexage avancé.

#Recueillir
Selectionner une colonne, qui porte une Series, equivaut à utiliser df.A

In [22]:
df['A']

2013-01-01   -0.506639
2013-01-02    1.027316
2013-01-03   -1.030873
2013-01-04   -0.578162
2013-01-05   -1.186215
2013-01-06   -1.548989
Freq: D, Name: A, dtype: float64

Selectionner via [], qui découpe les lignes

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.506639 -0.261817  0.195977 -1.463272
2013-01-02  1.027316 -0.172998 -0.361223 -1.155115
2013-01-03 -1.030873 -0.538397 -1.402254  1.150479

In [24]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.027316 -0.172998 -0.361223 -1.155115
2013-01-03 -1.030873 -0.538397 -1.402254  1.150479
2013-01-04 -0.578162  1.133134 -0.567537  0.711612

#Sélecton par label
Voyez aussi dans Selection par label
Pour avoir une section croisée en utilisant label

In [25]:
df.loc[dates[0]]

A   -0.506639
B   -0.261817
C    0.195977
D   -1.463272
Name: 2013-01-01 00:00:00, dtype: float64

Selectionner sur plusieurs axes

In [26]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.506639 -0.261817
2013-01-02  1.027316 -0.172998
2013-01-03 -1.030873 -0.538397
2013-01-04 -0.578162  1.133134
2013-01-05 -1.186215  1.311326
2013-01-06 -1.548989 -1.048483

Montrer le decoupage de label, les deux points de fin sont indiques

In [27]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.027316 -0.172998
2013-01-03 -1.030873 -0.538397
2013-01-04 -0.578162  1.133134

Reduction dans les dimensions retourne un objet

In [28]:
df.loc['20130102',['A','B']]

A    1.027316
B   -0.172998
Name: 2013-01-02 00:00:00, dtype: float64

Pour avoir une valeur scalaire

In [29]:
df.loc[dates[0],'A']

-0.50663934799186694

Pour avoir un acces rapide à un scalaire (equivalent à avoir la valeur précédente).

In [30]:
df.at[dates[0],'A']

-0.50663934799186694

#Selectionner par position
Voyez aussi la Selection par Position
Selection avec la position des entiers passes

In [31]:
df.iloc[3]

A   -0.578162
B    1.133134
C   -0.567537
D    0.711612
Name: 2013-01-04 00:00:00, dtype: float64

En decoupant par entier, cela se comporte pareillement qu'avec numpy et python

In [32]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.578162  1.133134
2013-01-05 -1.186215  1.311326

Par la position des lists d'entiers, similaire a numpy/ python

In [33]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.027316 -0.361223
2013-01-03 -1.030873 -1.402254
2013-01-05 -1.186215 -1.522868

Pour découper les lignes explicitement

In [34]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.027316 -0.172998 -0.361223 -1.155115
2013-01-03 -1.030873 -0.538397 -1.402254  1.150479

Pour découper les colonnes explicitement

In [35]:

df.iloc[:,1:3]

                   B         C
2013-01-01 -0.261817  0.195977
2013-01-02 -0.172998 -0.361223
2013-01-03 -0.538397 -1.402254
2013-01-04  1.133134 -0.567537
2013-01-05  1.311326 -1.522868
2013-01-06 -1.048483 -0.048604

Pour obtenir une valeur explicitement

In [36]:
df.iloc[1,1]

-0.17299823752229945

Pour obtenir une accession rapide a un scalaire (equivalent a la valeur precedente)

In [37]:
df.iat[1,1]

-0.17299823752229945

Indexation de boolean
En utilisant les valeurs d'une seule colonne pour selectionner les donnees

In [38]:
df[df.A>0]

                   A         B         C         D
2013-01-02  1.027316 -0.172998 -0.361223 -1.155115

Selectionner les valeurs de DataFrame ou les conditions sont rencontrees

In [39]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN  0.195977       NaN
2013-01-02  1.027316       NaN       NaN       NaN
2013-01-03       NaN       NaN       NaN  1.150479
2013-01-04       NaN  1.133134       NaN  0.711612
2013-01-05       NaN  1.311326       NaN  0.565255
2013-01-06       NaN       NaN       NaN  1.387529

En utilisant isin() pour filtrer

In [40]:
df2=df.copy()

In [41]:
df2['E'] =['one', 'one','two','three','four','three']

In [42]:
df2

                   A         B         C         D      E
2013-01-01 -0.506639 -0.261817  0.195977 -1.463272    one
2013-01-02  1.027316 -0.172998 -0.361223 -1.155115    one
2013-01-03 -1.030873 -0.538397 -1.402254  1.150479    two
2013-01-04 -0.578162  1.133134 -0.567537  0.711612  three
2013-01-05 -1.186215  1.311326 -1.522868  0.565255   four
2013-01-06 -1.548989 -1.048483 -0.048604  1.387529  three

In [43]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.030873 -0.538397 -1.402254  1.150479   two
2013-01-05 -1.186215  1.311326 -1.522868  0.565255  four

Configuration
Configuration une nouvelle colonne automatiquement pour aligner les donnees par index

In [44]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))

In [45]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [46]:
df['F'] = s1

Configurer les valeurs par label

In [47]:
df.at[dates[0],'A']=0

Configurer les valeurs par position

In [48]:
df.iat[0,1]=0

Configurer en assignant une liste numpy

In [49]:
df.loc[:,'D'] = np.array([5] * len(df))

Le resultat de l'operation de configuration precedent

In [50]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.195977  5  NaN
2013-01-02  1.027316 -0.172998 -0.361223  5  1.0
2013-01-03 -1.030873 -0.538397 -1.402254  5  2.0
2013-01-04 -0.578162  1.133134 -0.567537  5  3.0
2013-01-05 -1.186215  1.311326 -1.522868  5  4.0
2013-01-06 -1.548989 -1.048483 -0.048604  5  5.0

L'operation where avec configuration

In [51]:
df2=df.copy()

In [52]:
df2[df2>0]=-df2

In [53]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.195977 -5  NaN
2013-01-02 -1.027316 -0.172998 -0.361223 -5 -1.0
2013-01-03 -1.030873 -0.538397 -1.402254 -5 -2.0
2013-01-04 -0.578162 -1.133134 -0.567537 -5 -3.0
2013-01-05 -1.186215 -1.311326 -1.522868 -5 -4.0
2013-01-06 -1.548989 -1.048483 -0.048604 -5 -5.0

Données manquantes
Pandas utilise np.nan pour représenter les données manquantes. C'est par défaut non inclut dans les calculs. Voyez la section des données manquantes.
La réindexation vous permet de changer/ajouter/supprimer sur un axe spécifique. Cela retourne une copie des données.

In [56]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [57]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [58]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.195977  5  NaN  1.0
2013-01-02  1.027316 -0.172998 -0.361223  5  1.0  1.0
2013-01-03 -1.030873 -0.538397 -1.402254  5  2.0  NaN
2013-01-04 -0.578162  1.133134 -0.567537  5  3.0  NaN

Pour supprimer une ligne qui a des données manquantes

In [59]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  1.027316 -0.172998 -0.361223  5  1.0  1.0

Remplir les donnees manquantes

In [60]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  0.195977  5  5.0  1.0
2013-01-02  1.027316 -0.172998 -0.361223  5  1.0  1.0
2013-01-03 -1.030873 -0.538397 -1.402254  5  2.0  5.0
2013-01-04 -0.578162  1.133134 -0.567537  5  3.0  5.0

Pour avoir un masque booeleen ou les valeurs sont nan

In [61]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

Operations
Voyez la section des operations basiques

Stats
Les operations en general excluent les donnees manquantes
Faisons des statistiques descriptives

In [62]:
df.mean()

A   -0.552820
B    0.114097
C   -0.617752
D    5.000000
F    3.000000
dtype: float64

Meme operation sur d'autres axes

In [63]:
df.mean(1)

2013-01-01    1.298994
2013-01-02    1.298619
2013-01-03    0.805695
2013-01-04    1.597487
2013-01-05    1.520449
2013-01-06    1.470785
Freq: D, dtype: float64

Travailler sur des objets qui ont des dimensionalités différents et qui ont besoin d'alignement. En addition, pandas diffuse automatiquement parmi les dimensions spécifiques.

In [64]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)

In [65]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [66]:
df.sub(s, axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.030873 -1.538397 -2.402254  4.0  1.0
2013-01-04 -3.578162 -1.866866 -3.567537  2.0  0.0
2013-01-05 -6.186215 -3.688674 -6.522868  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

Apply
Appliquer des fonctions aux données

In [67]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  0.195977   5   NaN
2013-01-02  1.027316 -0.172998 -0.165247  10   1.0
2013-01-03 -0.003557 -0.711395 -1.567501  15   3.0
2013-01-04 -0.581718  0.421738 -2.135038  20   6.0
2013-01-05 -1.767933  1.733064 -3.657906  25  10.0
2013-01-06 -3.316922  0.684581 -3.706510  30  15.0

In [68]:
df.apply(lambda x:x.max() - x.min())

A    2.576306
B    2.359809
C    1.718845
D    0.000000
F    4.000000
dtype: float64

Histogrammes
Voir aussi faire des histogrammes et la discretisation

In [69]:
s = pd.Series(np.random.randint(0, 7, size=10))

In [70]:
s

0    6
1    5
2    3
3    3
4    2
5    5
6    2
7    4
8    6
9    1
dtype: int32

In [71]:
s.value_counts()

6    2
5    2
3    2
2    2
4    1
1    1
dtype: int64

Les methodes de strings
Les series sont equipees avec un panel de methodes pour processer les strings dans l'attribut str ce qui le rend facile a operer sur chaque element de la liste, comme dans le code ci-dessous. Notez que le pattern matching dans str utilise generallement les expressions regulieres par defaut (et dans certains cas, on les utilise tt le temps). Voyez aussi la methode de vectorisation des strings.

In [72]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])

In [73]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

Fusion
Concat
Pandas fournit des moyens pour faciliter la combinaison de Series, DataFrame et les objets Panel avec differents type de logique de configuration pour les indexes et la fonctionnalite de d'algebre relationnel dans le cas des operations join/merge 
Voyez aussi la section de merging.
Concatener les objets pandas avec concat()

In [74]:
df = pd.DataFrame(np.random.randn(10, 4))

In [75]:
df

          0         1         2         3
0 -0.558515 -0.714092 -0.701551 -1.221392
1 -0.794188 -1.050384 -0.803082  1.258719
2  0.311774  0.505088  1.269589 -0.958573
3 -2.884719  0.964963  1.054510 -1.284488
4 -0.223895 -0.078337 -0.629716 -1.470522
5 -0.743560  0.294432 -1.584730 -1.105705
6  0.453046 -2.574025 -0.754904  1.049254
7 -1.072775  1.704082 -0.539403  0.937925
8 -0.173478 -0.152745  1.055451  0.146714
9  1.241240  0.236009  0.636424 -0.362731

In [76]:
# briser en plusieurs morceaux
morceaux = [df[:3], df[3:7], df[7:]]

In [77]:
pd.concat(morceaux)

          0         1         2         3
0 -0.558515 -0.714092 -0.701551 -1.221392
1 -0.794188 -1.050384 -0.803082  1.258719
2  0.311774  0.505088  1.269589 -0.958573
3 -2.884719  0.964963  1.054510 -1.284488
4 -0.223895 -0.078337 -0.629716 -1.470522
5 -0.743560  0.294432 -1.584730 -1.105705
6  0.453046 -2.574025 -0.754904  1.049254
7 -1.072775  1.704082 -0.539403  0.937925
8 -0.173478 -0.152745  1.055451  0.146714
9  1.241240  0.236009  0.636424 -0.362731

Joindre
Merging facon SQL. Voir aussi la jointure facon base de donnees

In [78]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})

In [79]:
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [80]:
left

   key  lval
0  foo     1
1  foo     2

In [81]:
right

   key  rval
0  foo     4
1  foo     5

In [82]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Un autre exemple peut etre donne ainsi :

In [83]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})

In [84]:
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})

In [85]:
left

   key  lval
0  foo     1
1  bar     2

In [86]:
right

   key  rval
0  foo     4
1  bar     5

In [87]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

Ajouter
Ajouter des lignes a un dataframe. Voir aussi l'ajout

In [88]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])

In [89]:
df

          A         B         C         D
0  1.963295  2.183828  0.064043 -0.318011
1  1.423555 -1.493503 -0.266715 -1.104094
2 -0.853360 -0.851214  0.156312  1.409802
3 -0.905888 -0.145236 -0.573120  1.686320
4  0.238307  1.615307  0.000260  0.333439
5  1.165844  0.186967  0.688794  0.523424
6 -0.187722  1.244960  1.101115  1.233595
7 -0.778065 -0.453197  0.881830  1.229979

In [90]:
s = df.iloc[3]

In [91]:
df.append(s, ignore_index=True)

          A         B         C         D
0  1.963295  2.183828  0.064043 -0.318011
1  1.423555 -1.493503 -0.266715 -1.104094
2 -0.853360 -0.851214  0.156312  1.409802
3 -0.905888 -0.145236 -0.573120  1.686320
4  0.238307  1.615307  0.000260  0.333439
5  1.165844  0.186967  0.688794  0.523424
6 -0.187722  1.244960  1.101115  1.233595
7 -0.778065 -0.453197  0.881830  1.229979
8 -0.905888 -0.145236 -0.573120  1.686320

Grouper
En utilisant "group by", on se refere a un process qui inclut un ou plus des etapes suivantes : 
-Separation des donnees en groupe base sur des criteres
-Appliquer une fonction a chaque groupe independemment
-Combiner les resultats en structures de donnees
Voir aussi la section sur le groupement

In [92]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
   ....:                           'foo', 'bar', 'foo', 'foo'],
   ....:                    'B' : ['one', 'one', 'two', 'three',
   ....:                           'two', 'two', 'one', 'three'],
   ....:                    'C' : np.random.randn(8),
   ....:                    'D' : np.random.randn(8)})
   ....:

In [93]:
df

     A      B         C         D
0  foo    one  0.506667  0.179169
1  bar    one  0.852301  0.093602
2  foo    two  1.469061 -0.943080
3  bar  three  0.018062 -0.388430
4  foo    two  0.559767 -0.148276
5  bar    two -0.327882  0.537810
6  foo    one  0.701752 -1.571628
7  foo  three -0.095069  0.379311

Grouper et appliquer une fonction sum au groupe resultant

In [94]:
df.groupby('A').sum()

            C         D
A
bar  0.542481  0.242982
foo  3.142177 -2.104504

Groupe par plusieurs colonnes forme un index hierarchique, auquel on peut appliquer la fonction apply.

In [95]:
 df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.852301  0.093602
    three  0.018062 -0.388430
    two   -0.327882  0.537810
foo one    1.208419 -1.392459
    three -0.095069  0.379311
    two    2.028827 -1.091356